leon-v/MQTT-ESP8266-nRF24L01-Solar-Battery-I-O-Network/Sensor_Node/Firmware/v0.1/nRF24L01+_PIC16LF1503.X/flash.c
#include <pic16lf1503.h>
#include <xc.h>
#include "flash.h"

void write_flashmem(unsigned int offset, unsigned int data) {
    
    INTCONbits.GIE = 0; //disable interupts incase they interfere
    
    //ERASE SECTION
    PMCON1 = 0x00;     //not configuration space
    
    PMADRL = (char) ((NV_ADDRESS + offset) >> 0);  //least significant bits of address
    PMADRH = (char) ((NV_ADDRESS + offset) >> 8);  //most significant bits of address 
    
    PMCON1bits.FREE = 1; //specify erase operation
    PMCON1bits.WREN = 1; //allow write
    
    PMCON2 = 0x55;  //unlock program memory
    PMCON2 = 0xAA;  //unlock program memory
    
    PMCON1bits.WR = 1; //begin write
    
    NOP();    //to give time to write
    NOP();    //to give time to write
    
    PMCON1bits.WREN = 0; //disallow write
    //END OF ERASE SECTION

    //WRITE SECTION
    PMCON1 = 0x00;     //not configuration space
    
    PMADRL = (char) ((NV_ADDRESS + offset) >> 0);  //least significant bits of address
    PMADRH = (char) ((NV_ADDRESS + offset) >> 8);  //most significant bits of address 
    
    PMCON1bits.FREE = 0;    //selecting write operation
    PMCON1bits.LWLO = 1;    //load write latches only
    PMCON1bits.WREN = 1;    //allow write
    
    PMDATL = (data >> 0);  //write least significant bits of data to latch
    PMDATH = (data >> 8);  //write most significant bits of data to latch
    
    PMCON1bits.LWLO = 0;   //write latches to flash
    
    PMCON2 = 0x55;          //unlock program memory
    PMCON2 = 0xAA;          //unlock program memory
    
    PMCON1bits.WR = 1;      //begin write
    
    NOP();                  //to give time to write
    NOP();                  //to give time to write
    
    PMCON1bits.WREN = 0;    //disallow write
    
    //END OF WRITE SECTION
    INTCONbits.GIE = 1;        //enable interupts again
}

unsigned int read_flashmem(unsigned int offset) {
    
    INTCONbits.GIE = 0; //disable interupts incase they interfere
    
    PMCON1 = 0x00;     //not configuration space
    
    PMADRL = (char) ((NV_ADDRESS + offset) >> 0);  //least significant bits of address
    PMADRH = (char) ((NV_ADDRESS + offset) >> 8);  //most significant bits of address 
    
    PMCON1bits.RD = 1;  //initiate read operation
    
    NOP();              //to give time to read
    NOP();              //to give time to read
    
    unsigned int result = (unsigned) ((PMDATH) << 8) | (PMDATL);  //joins bytes & returns the value stored
    
    INTCONbits.GIE = 1;        //enable interupts again
    
    return result;
}

